lxydiy/contest2026_128_xiaolidianzishiyanshi/chip/esp32p4/esp32p4_ppa_dma2d.c
/****************************************************************************
 * arch/risc-v/src/esp32p4/esp32p4_ppa_dma2d.c
 *
 * SPDX-FileCopyrightText: 2023-2025 Espressif Systems (Shanghai) CO LTD
 * SPDX-License-Identifier: Apache-2.0
 *
 * The descriptor layout and programming order are adapted from Espressif's
 * upper_hal_ppa and upper_hal_dma drivers.  FreeRTOS scheduling and channel
 * allocation are replaced with one NuttX mutex, fixed rev0/1.x-safe channels,
 * an RX EOF interrupt, and a bounded semaphore wait.
 ****************************************************************************/

#include <nuttx/config.h>

#include <errno.h>
#include <sched.h>
#include <stdbool.h>
#include <stdint.h>
#include <string.h>
#include <syslog.h>

#include <nuttx/arch.h>
#include <nuttx/clock.h>
#include <nuttx/irq.h>
#include <nuttx/mutex.h>
#include <nuttx/semaphore.h>

#include "esp32p4_ppa_internal.h"
#include "espressif/esp_irq.h"

#include "esp_cache.h"
#include "esp_err.h"
#include "esp_private/periph_ctrl.h"
#include "hal/dma2d_hal.h"
#include "hal/dma2d_ll.h"
#include "hal/dma2d_periph.h"
#include "hal/ppa_hal.h"
#include "hal/ppa_ll.h"
#include "soc/dma2d_channel.h"

#define ESP32P4_PPA_DMA_GROUP       0
#define ESP32P4_PPA_TX_BG_CHANNEL   0
#define ESP32P4_PPA_TX_FG_CHANNEL   1
#define ESP32P4_PPA_RX_CHANNEL      0
#define ESP32P4_PPA_RX_EVENTS       (DMA2D_LL_EVENT_RX_SUC_EOF | \
                                     DMA2D_LL_EVENT_RX_ERR_EOF | \
                                     DMA2D_LL_EVENT_RX_DESC_ERROR)
#define ESP32P4_PPA_RX_ERROR_EVENTS (ESP32P4_PPA_RX_EVENTS & \
                                     ~DMA2D_LL_EVENT_RX_SUC_EOF)
#define ESP32P4_PPA_CACHE_LINE_SIZE CONFIG_ESPRESSIF_CACHE_L1_CACHE_LINE_SIZE

struct esp32p4_ppa_dma_desc_s
{
  dma2d_descriptor_t desc;
  uint8_t padding[ESP32P4_PPA_CACHE_LINE_SIZE -
                  sizeof(dma2d_descriptor_t)];
} __attribute__((aligned(ESP32P4_PPA_CACHE_LINE_SIZE)));

struct esp32p4_ppa_platform_s
{
  mutex_t lock;
  sem_t done;
  ppa_hal_context_t ppa_hal;
  dma2d_hal_context_t dma_hal;
  unsigned int users;
  int cpuint;
  volatile uint32_t irq_status;
  bool initialized;
#ifdef CONFIG_ESP32P4_PPA_DEBUG
  uint32_t sequence_counter;
  volatile uint32_t active_sequence;
  volatile uint32_t isr_sequence;
  volatile uint32_t isr_status;
  volatile uint32_t isr_eof_desc;
  volatile uint32_t isr_ppa_int_raw;
  volatile uint32_t isr_blend_mode;
  volatile bool isr_rx_idle;
  volatile bool isr_desc_idle;
#endif
};

static struct esp32p4_ppa_dma_desc_s g_ppa_rx_desc;
static struct esp32p4_ppa_dma_desc_s g_ppa_tx_bg_desc;
static struct esp32p4_ppa_dma_desc_s g_ppa_tx_fg_desc;

static struct esp32p4_ppa_platform_s g_ppa =
{
  .lock = NXMUTEX_INITIALIZER,
  .done = SEM_INITIALIZER(0),
  .cpuint = -1,
};

static dma2d_data_burst_length_t
esp32p4_ppa_dma_burst(enum esp32p4_ppa_burst_length_e burst)
{
  return (dma2d_data_burst_length_t)
         (burst == ESP32P4_PPA_BURST_LENGTH_8 ? DMA2D_DATA_BURST_LENGTH_8 :
          burst == ESP32P4_PPA_BURST_LENGTH_16 ? DMA2D_DATA_BURST_LENGTH_16 :
          burst == ESP32P4_PPA_BURST_LENGTH_32 ? DMA2D_DATA_BURST_LENGTH_32 :
          burst == ESP32P4_PPA_BURST_LENGTH_64 ? DMA2D_DATA_BURST_LENGTH_64 :
                                                DMA2D_DATA_BURST_LENGTH_128);
}

static uint32_t esp32p4_ppa_pbyte(enum esp32p4_ppa_color_mode_e mode)
{
  switch (mode)
    {
      case ESP32P4_PPA_COLOR_MODE_RGB565:
        return DMA2D_DESCRIPTOR_PBYTE_2B0_PER_PIXEL;
      case ESP32P4_PPA_COLOR_MODE_RGB888:
        return DMA2D_DESCRIPTOR_PBYTE_3B0_PER_PIXEL;
      case ESP32P4_PPA_COLOR_MODE_A8:
        return DMA2D_DESCRIPTOR_PBYTE_1B0_PER_PIXEL;
      default:
        return DMA2D_DESCRIPTOR_PBYTE_4B0_PER_PIXEL;
    }
}

static void esp32p4_ppa_drain_done(void)
{
  while (nxsem_trywait(&g_ppa.done) == 0)
    {
    }
}

static void esp32p4_ppa_rx_reset(void)
{
  dma2d_ll_rx_enable_interrupt(g_ppa.dma_hal.dev,
                               ESP32P4_PPA_RX_CHANNEL,
                               UINT32_MAX, false);
  dma2d_ll_rx_clear_interrupt_status(g_ppa.dma_hal.dev,
                                     ESP32P4_PPA_RX_CHANNEL,
                                     UINT32_MAX);
  dma2d_ll_rx_stop(g_ppa.dma_hal.dev, ESP32P4_PPA_RX_CHANNEL);
  dma2d_hal_rx_reset_channel(&g_ppa.dma_hal, ESP32P4_PPA_RX_CHANNEL);
  ppa_ll_blend_reset(g_ppa.ppa_hal.dev);
  esp32p4_ppa_drain_done();
}

static void esp32p4_ppa_tx_reset(uint32_t channel)
{
  dma2d_ll_tx_enable_interrupt(g_ppa.dma_hal.dev, channel,
                               UINT32_MAX, false);
  dma2d_ll_tx_clear_interrupt_status(g_ppa.dma_hal.dev, channel,
                                     UINT32_MAX);
  dma2d_ll_tx_stop(g_ppa.dma_hal.dev, channel);
  dma2d_hal_tx_reset_channel(&g_ppa.dma_hal, channel);
}

static void esp32p4_ppa_configure_tx(uint32_t channel,
                                     dma2d_trigger_peripheral_t periph,
                                     int periph_id, bool descriptor_port,
                                     dma2d_data_burst_length_t burst)
{
  esp32p4_ppa_tx_reset(channel);
  dma2d_ll_tx_connect_to_periph(g_ppa.dma_hal.dev, channel,
                                periph, periph_id);
  dma2d_ll_tx_enable_reorder(g_ppa.dma_hal.dev, channel, false);
  dma2d_ll_tx_enable_dscr_port(g_ppa.dma_hal.dev, channel,
                               descriptor_port);
  dma2d_ll_tx_enable_owner_check(g_ppa.dma_hal.dev, channel, false);
  dma2d_ll_tx_enable_auto_write_back(g_ppa.dma_hal.dev, channel, false);
  dma2d_ll_tx_enable_eof_mode(g_ppa.dma_hal.dev, channel, true);
  dma2d_ll_tx_enable_descriptor_burst(g_ppa.dma_hal.dev, channel, true);
  dma2d_ll_tx_set_data_burst_length(g_ppa.dma_hal.dev, channel, burst);
  dma2d_ll_tx_enable_page_bound_wrap(g_ppa.dma_hal.dev, channel, true);
  dma2d_ll_tx_set_macro_block_size(g_ppa.dma_hal.dev, channel,
                                   DMA2D_MACRO_BLOCK_SIZE_NONE);
}

static void esp32p4_ppa_configure_rx(dma2d_trigger_peripheral_t periph,
                                     int periph_id, bool descriptor_port,
                                     dma2d_data_burst_length_t burst)
{
  dma2d_ll_rx_connect_to_periph(g_ppa.dma_hal.dev,
                                ESP32P4_PPA_RX_CHANNEL,
                                periph, periph_id);
  dma2d_ll_rx_enable_reorder(g_ppa.dma_hal.dev,
                             ESP32P4_PPA_RX_CHANNEL, false);
  dma2d_ll_rx_enable_dscr_port(g_ppa.dma_hal.dev,
                               ESP32P4_PPA_RX_CHANNEL,
                               descriptor_port);
  dma2d_ll_rx_enable_owner_check(g_ppa.dma_hal.dev,
                                 ESP32P4_PPA_RX_CHANNEL, false);
  dma2d_ll_rx_set_auto_return_owner(g_ppa.dma_hal.dev,
                                    ESP32P4_PPA_RX_CHANNEL,
                                    DMA2D_DESCRIPTOR_BUFFER_OWNER_CPU);
  dma2d_ll_rx_enable_descriptor_burst(g_ppa.dma_hal.dev,
                                      ESP32P4_PPA_RX_CHANNEL, true);
  dma2d_ll_rx_set_data_burst_length(g_ppa.dma_hal.dev,
                                    ESP32P4_PPA_RX_CHANNEL, burst);
  dma2d_ll_rx_enable_page_bound_wrap(g_ppa.dma_hal.dev,
                                     ESP32P4_PPA_RX_CHANNEL, true);
  dma2d_ll_rx_set_macro_block_size(g_ppa.dma_hal.dev,
                                   ESP32P4_PPA_RX_CHANNEL,
                                   DMA2D_MACRO_BLOCK_SIZE_NONE);
}

