lxydiy/contest2026_128_xiaolidianzishiyanshi/chip/esp32p4/esp32p4_ppa_dma2d.c
static void esp32p4_ppa_prepare_desc(
  dma2d_descriptor_t *desc,
  const struct esp32p4_ppa_picture_s *picture)
{
  uint32_t stride_pixels;

  memset(desc, 0, sizeof(*desc));
  stride_pixels = picture->stride_bytes /
                  (picture->color_mode == ESP32P4_PPA_COLOR_MODE_RGB565 ? 2 :
                   picture->color_mode == ESP32P4_PPA_COLOR_MODE_RGB888 ? 3 :
                   picture->color_mode == ESP32P4_PPA_COLOR_MODE_A8 ? 1 : 4);
  desc->vb_size = picture->block_height;
  desc->hb_length = picture->block_width;
  desc->dma2d_en = 1;
  desc->suc_eof = 1;
  desc->owner = DMA2D_DESCRIPTOR_BUFFER_OWNER_DMA;
  desc->va_size = picture->pic_height;
  desc->ha_length = stride_pixels;
  desc->pbyte = esp32p4_ppa_pbyte(picture->color_mode);
  desc->y = picture->block_offset_y;
  desc->x = picture->block_offset_x;
  desc->mode = DMA2D_DESCRIPTOR_BLOCK_RW_MODE_SINGLE;
  desc->buffer = picture->buffer;
}

static int esp32p4_ppa_sync_desc(struct esp32p4_ppa_dma_desc_s *storage)
{
  int ret;

  ret = esp_cache_msync(storage, sizeof(*storage),
                        ESP_CACHE_MSYNC_FLAG_DIR_C2M);
  return ret == ESP_OK || ret == ESP_ERR_NOT_SUPPORTED ? 0 : -EIO;
}

static int esp32p4_ppa_sync_buffer(void *buffer, size_t size,
                                  uint32_t flags)
{
  int ret = esp_cache_msync(buffer, size, flags);

  return ret == ESP_OK || ret == ESP_ERR_NOT_SUPPORTED ? 0 : -EIO;
}

static int esp32p4_ppa_wait(dma2d_descriptor_t *desc, const char *operation)
{
  int ret;

  (void)operation;
  ret = nxsem_tickwait_uninterruptible(
    &g_ppa.done, MSEC2TICK(CONFIG_ESP32P4_PPA_TIMEOUT_MS));
#ifdef CONFIG_ESP32P4_PPA_DEBUG
  syslog(LOG_INFO,
         "PPA_TRACE op=%s s=%lu w=%d irq=%lx eof=%lx d=%lx idle=%u/%u\n",
         operation, (unsigned long)g_ppa.active_sequence, ret,
         (unsigned long)g_ppa.isr_status,
         (unsigned long)g_ppa.isr_eof_desc,
         (unsigned long)(uintptr_t)desc,
         (unsigned int)g_ppa.isr_rx_idle,
         (unsigned int)g_ppa.isr_desc_idle);
#endif
  if (ret < 0)
    {
      return ret == -ETIMEDOUT ? -ETIMEDOUT : -EIO;
    }

  if ((g_ppa.irq_status & DMA2D_LL_EVENT_RX_SUC_EOF) == 0 ||
      (g_ppa.irq_status & ESP32P4_PPA_RX_ERROR_EVENTS) != 0 ||
      dma2d_ll_rx_get_success_eof_desc_addr(g_ppa.dma_hal.dev,
        ESP32P4_PPA_RX_CHANNEL) != (uint32_t)(uintptr_t)desc ||
      !dma2d_ll_rx_is_fsm_idle(g_ppa.dma_hal.dev,
                               ESP32P4_PPA_RX_CHANNEL) ||
      !dma2d_ll_rx_is_desc_fsm_idle(g_ppa.dma_hal.dev,
                                    ESP32P4_PPA_RX_CHANNEL))
    {
      return -EIO;
    }

  dma2d_ll_rx_enable_interrupt(g_ppa.dma_hal.dev,
                               ESP32P4_PPA_RX_CHANNEL,
                               UINT32_MAX, false);
  return 0;
}

static int esp32p4_ppa_rx_interrupt(int irq, void *context, void *arg)
{
  uint32_t status;

  status = dma2d_ll_rx_get_interrupt_status(g_ppa.dma_hal.dev,
                                             ESP32P4_PPA_RX_CHANNEL) &
           ESP32P4_PPA_RX_EVENTS;
  if (status == 0)
    {
      return OK;
    }

#ifdef CONFIG_ESP32P4_PPA_DEBUG
  g_ppa.isr_sequence = g_ppa.active_sequence;
  g_ppa.isr_status = status;
  g_ppa.isr_eof_desc =
    dma2d_ll_rx_get_success_eof_desc_addr(g_ppa.dma_hal.dev,
                                          ESP32P4_PPA_RX_CHANNEL);
  g_ppa.isr_rx_idle =
    dma2d_ll_rx_is_fsm_idle(g_ppa.dma_hal.dev,
                            ESP32P4_PPA_RX_CHANNEL);
  g_ppa.isr_desc_idle =
    dma2d_ll_rx_is_desc_fsm_idle(g_ppa.dma_hal.dev,
                                 ESP32P4_PPA_RX_CHANNEL);
  g_ppa.isr_ppa_int_raw = g_ppa.ppa_hal.dev->int_raw.val;
  g_ppa.isr_blend_mode = g_ppa.ppa_hal.dev->blend_trans_mode.val;
#endif

  dma2d_ll_rx_enable_interrupt(g_ppa.dma_hal.dev,
                               ESP32P4_PPA_RX_CHANNEL,
                               ESP32P4_PPA_RX_EVENTS, false);
  dma2d_ll_rx_clear_interrupt_status(g_ppa.dma_hal.dev,
                                     ESP32P4_PPA_RX_CHANNEL, status);
  g_ppa.irq_status |= status;
  nxsem_post(&g_ppa.done);
  return OK;
}

static int esp32p4_ppa_hw_initialize(void)
{
  bool enable_irq = false;
  int cpuint;

  PERIPH_RCC_ATOMIC()
    {
      ppa_ll_enable_bus_clock(true);
      ppa_ll_reset_register();
    }

  ppa_hal_init(&g_ppa.ppa_hal);

  PERIPH_RCC_ATOMIC()
    {
      dma2d_ll_enable_bus_clock(ESP32P4_PPA_DMA_GROUP, true);
      dma2d_ll_reset_register(ESP32P4_PPA_DMA_GROUP);
    }

  dma2d_hal_init(&g_ppa.dma_hal, ESP32P4_PPA_DMA_GROUP);
  dma2d_ll_hw_enable(g_ppa.dma_hal.dev, true);

  if (g_ppa.cpuint < 0)
    {
      cpuint = esp_setup_irq(
        dma2d_periph_signals.groups[ESP32P4_PPA_DMA_GROUP]
          .rx_irq_id[ESP32P4_PPA_RX_CHANNEL],
        ESP_IRQ_PRIORITY_DEFAULT, ESP_IRQ_TRIGGER_LEVEL,
        esp32p4_ppa_rx_interrupt, NULL);
      if (cpuint < 0)
        {
          dma2d_ll_hw_enable(g_ppa.dma_hal.dev, false);
          PERIPH_RCC_ATOMIC()
            {
              dma2d_ll_enable_bus_clock(ESP32P4_PPA_DMA_GROUP, false);
              ppa_ll_enable_bus_clock(false);
            }

          ppa_hal_deinit(&g_ppa.ppa_hal);
          return cpuint;
        }

      g_ppa.cpuint = cpuint;
      enable_irq = true;
    }

  g_ppa.irq_status = 0;
  esp32p4_ppa_rx_reset();
  if (enable_irq)
    {
      up_enable_irq(ESP_SOURCE2IRQ(
        dma2d_periph_signals.groups[ESP32P4_PPA_DMA_GROUP]
          .rx_irq_id[ESP32P4_PPA_RX_CHANNEL]));
    }

  g_ppa.initialized = true;
  return 0;
}

int esp32p4_ppa_hw_acquire(void)
{
  int ret;

  ret = nxmutex_lock(&g_ppa.lock);
  if (ret < 0)
    {
      return ret;
    }

  if (!g_ppa.initialized)
    {
      /* esp_setup_irq() and up_enable_irq() must observe the same CPU-local
       * interrupt handle map.
       */

      sched_lock();
      ret = esp32p4_ppa_hw_initialize();
      sched_unlock();
      if (ret < 0)
        {
          nxmutex_unlock(&g_ppa.lock);
          return ret;
        }
    }

