lxydiy/contest2026_128_xiaolidianzishiyanshi/chip/esp32p4/esp32p4_ppa_dma2d.c
  g_ppa.users++;
  nxmutex_unlock(&g_ppa.lock);
  return 0;
}

int esp32p4_ppa_hw_release(void)
{
  int ret;

  ret = nxmutex_lock(&g_ppa.lock);
  if (ret < 0)
    {
      return ret;
    }

  if (g_ppa.users == 0)
    {
      nxmutex_unlock(&g_ppa.lock);
      return -EINVAL;
    }

  g_ppa.users--;

  /* Match the ESP-IDF engine lifetime: the last client leaves no live PPA or
   * DMA2D transaction behind.  Keep the CPU interrupt route allocated because
   * NuttX stores its handle per CPU and a client can unregister after task
   * migration.  With the peripheral interrupt disabled and both clocks gated,
   * the dormant route has no interrupt source to service.
   */

  if (g_ppa.users == 0)
    {
      esp32p4_ppa_rx_reset();
      g_ppa.irq_status = 0;
      dma2d_ll_hw_enable(g_ppa.dma_hal.dev, false);

      PERIPH_RCC_ATOMIC()
        {
          dma2d_ll_enable_bus_clock(ESP32P4_PPA_DMA_GROUP, false);
        }

      ppa_hal_deinit(&g_ppa.ppa_hal);

      PERIPH_RCC_ATOMIC()
        {
          ppa_ll_enable_bus_clock(false);
        }

      g_ppa.initialized = false;
    }

  nxmutex_unlock(&g_ppa.lock);
  return 0;
}

int esp32p4_ppa_dma2d_fill(esp32p4_ppa_handle_t handle,
                           const struct esp32p4_ppa_fill_config_s *config)
{
  const struct esp32p4_ppa_picture_s *output = &config->output;
  dma2d_descriptor_t *desc = &g_ppa_rx_desc.desc;
  uint32_t stride_pixels;
#ifdef CONFIG_ESP32P4_PPA_DEBUG
  uint32_t sequence;
  uint32_t configured_color;
#endif
  int ret;

  ret = nxmutex_lock(&g_ppa.lock);
  if (ret < 0)
    {
      return ret;
    }

  if (!g_ppa.initialized)
    {
      ret = -EIO;
      goto out_unlock;
    }

  esp32p4_ppa_rx_reset();
  g_ppa.irq_status = 0;
#ifdef CONFIG_ESP32P4_PPA_DEBUG
  sequence = ++g_ppa.sequence_counter;
  g_ppa.active_sequence = sequence;
  g_ppa.isr_sequence = 0;
  g_ppa.isr_status = 0;
  g_ppa.isr_eof_desc = 0;
  g_ppa.isr_ppa_int_raw = 0;
  g_ppa.isr_blend_mode = 0;
  g_ppa.isr_rx_idle = false;
  g_ppa.isr_desc_idle = false;
#endif
  memset(desc, 0, sizeof(*desc));
  stride_pixels = output->stride_bytes /
                  (output->color_mode == ESP32P4_PPA_COLOR_MODE_RGB565 ? 2 :
                   output->color_mode == ESP32P4_PPA_COLOR_MODE_RGB888 ? 3 : 4);

  desc->vb_size = output->block_height;
  desc->hb_length = output->block_width;
  desc->dma2d_en = 1;
  desc->suc_eof = 1;
  desc->owner = DMA2D_DESCRIPTOR_BUFFER_OWNER_DMA;
  desc->va_size = output->pic_height;
  desc->ha_length = stride_pixels;
  desc->pbyte = esp32p4_ppa_pbyte(output->color_mode);
  desc->y = output->block_offset_y;
  desc->x = output->block_offset_x;
  desc->mode = DMA2D_DESCRIPTOR_BLOCK_RW_MODE_SINGLE;
  desc->buffer = output->buffer;

  ret = esp_cache_msync(output->buffer, output->buffer_size,
                        ESP_CACHE_MSYNC_FLAG_DIR_C2M |
                        ESP_CACHE_MSYNC_FLAG_INVALIDATE);
  if (ret != ESP_OK && ret != ESP_ERR_NOT_SUPPORTED)
    {
      ret = -EIO;
      goto out_unlock;
    }

  ret = esp_cache_msync(&g_ppa_rx_desc, sizeof(g_ppa_rx_desc),
                        ESP_CACHE_MSYNC_FLAG_DIR_C2M);
  if (ret != ESP_OK && ret != ESP_ERR_NOT_SUPPORTED)
    {
      ret = -EIO;
      goto out_unlock;
    }

  dma2d_ll_rx_connect_to_periph(g_ppa.dma_hal.dev,
                                ESP32P4_PPA_RX_CHANNEL,
                                DMA2D_TRIG_PERIPH_PPA_BLEND,
                                SOC_DMA2D_TRIG_PERIPH_PPA_BLEND_RX);
  dma2d_ll_rx_enable_reorder(g_ppa.dma_hal.dev,
                             ESP32P4_PPA_RX_CHANNEL, false);
  dma2d_ll_rx_enable_dscr_port(g_ppa.dma_hal.dev,
                               ESP32P4_PPA_RX_CHANNEL, false);
  dma2d_ll_rx_enable_owner_check(g_ppa.dma_hal.dev,
                                 ESP32P4_PPA_RX_CHANNEL, false);
  dma2d_ll_rx_set_auto_return_owner(g_ppa.dma_hal.dev,
                                    ESP32P4_PPA_RX_CHANNEL,
                                    DMA2D_DESCRIPTOR_BUFFER_OWNER_CPU);
  dma2d_ll_rx_enable_descriptor_burst(g_ppa.dma_hal.dev,
                                      ESP32P4_PPA_RX_CHANNEL, true);
  dma2d_ll_rx_set_data_burst_length(g_ppa.dma_hal.dev,
                                    ESP32P4_PPA_RX_CHANNEL,
                                    esp32p4_ppa_dma_burst(
                                      handle->burst_length));
  dma2d_ll_rx_enable_page_bound_wrap(g_ppa.dma_hal.dev,
                                     ESP32P4_PPA_RX_CHANNEL, true);
  dma2d_ll_rx_set_macro_block_size(g_ppa.dma_hal.dev,
                                   ESP32P4_PPA_RX_CHANNEL,
                                   DMA2D_MACRO_BLOCK_SIZE_NONE);
  dma2d_ll_rx_clear_interrupt_status(g_ppa.dma_hal.dev,
                                     ESP32P4_PPA_RX_CHANNEL, UINT32_MAX);
  dma2d_ll_rx_enable_interrupt(g_ppa.dma_hal.dev,
                               ESP32P4_PPA_RX_CHANNEL,
                               ESP32P4_PPA_RX_EVENTS, true);
  dma2d_ll_rx_set_desc_addr(g_ppa.dma_hal.dev,
                            ESP32P4_PPA_RX_CHANNEL,
                            (uint32_t)(uintptr_t)desc);

  esp32p4_ppa_hal_configure_fill(g_ppa.ppa_hal.dev, config,
#ifdef CONFIG_ESP32P4_PPA_DEBUG
                                  &configured_color
#else
                                  NULL
#endif
                                  );

  dma2d_ll_rx_start(g_ppa.dma_hal.dev, ESP32P4_PPA_RX_CHANNEL);
  esp32p4_ppa_hal_start_fill(g_ppa.ppa_hal.dev);

  ret = nxsem_tickwait_uninterruptible(
    &g_ppa.done, MSEC2TICK(CONFIG_ESP32P4_PPA_TIMEOUT_MS));
  if (ret < 0)
    {
      ret = ret == -ETIMEDOUT ? -ETIMEDOUT : -EIO;
#ifdef CONFIG_ESP32P4_PPA_DEBUG
      syslog(LOG_INFO,
             "PPA_TRACE s=%lu w=%d c=%04lx hw=%08lx is=%lu irq=%lx "
             "eof=%lx d=%lx idle=%u/%u live=%lx/%u/%u\n",
             (unsigned long)sequence, ret,
             (unsigned long)config->color,
             (unsigned long)configured_color,
             (unsigned long)g_ppa.isr_sequence,
             (unsigned long)g_ppa.isr_status,
             (unsigned long)g_ppa.isr_eof_desc,
             (unsigned long)(uintptr_t)desc,
             (unsigned int)g_ppa.isr_rx_idle,
             (unsigned int)g_ppa.isr_desc_idle,
             (unsigned long)dma2d_ll_rx_get_interrupt_status(
               g_ppa.dma_hal.dev, ESP32P4_PPA_RX_CHANNEL),
             (unsigned int)dma2d_ll_rx_is_fsm_idle(
               g_ppa.dma_hal.dev, ESP32P4_PPA_RX_CHANNEL),
             (unsigned int)dma2d_ll_rx_is_desc_fsm_idle(
               g_ppa.dma_hal.dev, ESP32P4_PPA_RX_CHANNEL));
#endif
      esp32p4_ppa_rx_reset();
      goto out_unlock;
    }

#ifdef CONFIG_ESP32P4_PPA_DEBUG
  syslog(LOG_INFO,
         "PPA_TRACE s=%lu w=0 c=%04lx hw=%08lx is=%lu irq=%lx "
         "eof=%lx d=%lx idle=%u/%u\n",
         (unsigned long)sequence,
         (unsigned long)config->color,
         (unsigned long)configured_color,
         (unsigned long)g_ppa.isr_sequence,
         (unsigned long)g_ppa.isr_status,
         (unsigned long)g_ppa.isr_eof_desc,
         (unsigned long)(uintptr_t)desc,
         (unsigned int)g_ppa.isr_rx_idle,
         (unsigned int)g_ppa.isr_desc_idle);
#endif

  if ((g_ppa.irq_status & DMA2D_LL_EVENT_RX_SUC_EOF) == 0 ||
      (g_ppa.irq_status & ESP32P4_PPA_RX_ERROR_EVENTS) != 0)
    {
      ret = -EIO;
      esp32p4_ppa_rx_reset();
      goto out_unlock;
    }

