lxydiy/contest2026_128_xiaolidianzishiyanshi/chip/esp32p4/esp32p4_ppa_dma2d.c
  dma2d_ll_rx_enable_interrupt(g_ppa.dma_hal.dev,
                               ESP32P4_PPA_RX_CHANNEL,
                               UINT32_MAX, false);
  ret = esp_cache_msync(output->buffer, output->buffer_size,
                        ESP_CACHE_MSYNC_FLAG_DIR_M2C);
  if (ret != ESP_OK && ret != ESP_ERR_NOT_SUPPORTED)
    {
      ret = -EIO;
      goto out_unlock;
    }

  ret = 0;

out_unlock:
  nxmutex_unlock(&g_ppa.lock);
  return ret;
}

static ppa_srm_color_mode_t
esp32p4_ppa_srm_mode(enum esp32p4_ppa_color_mode_e mode)
{
  switch (mode)
    {
      case ESP32P4_PPA_COLOR_MODE_RGB565:
        return PPA_SRM_COLOR_MODE_RGB565;
      case ESP32P4_PPA_COLOR_MODE_RGB888:
        return PPA_SRM_COLOR_MODE_RGB888;
      default:
        return PPA_SRM_COLOR_MODE_ARGB8888;
    }
}

int esp32p4_ppa_dma2d_blend(esp32p4_ppa_handle_t handle,
                            const struct esp32p4_ppa_blend_config_s *config)
{
  dma2d_descriptor_t *bg_desc = &g_ppa_tx_bg_desc.desc;
  dma2d_descriptor_t *fg_desc = &g_ppa_tx_fg_desc.desc;
  dma2d_descriptor_t *out_desc = &g_ppa_rx_desc.desc;
  dma2d_data_burst_length_t burst;
  int ret;

  ret = nxmutex_lock(&g_ppa.lock);
  if (ret < 0)
    {
      return ret;
    }

  if (!g_ppa.initialized)
    {
      ret = -EIO;
      goto out_unlock;
    }

  esp32p4_ppa_rx_reset();
  esp32p4_ppa_tx_reset(ESP32P4_PPA_TX_BG_CHANNEL);
  esp32p4_ppa_tx_reset(ESP32P4_PPA_TX_FG_CHANNEL);
  g_ppa.irq_status = 0;
#ifdef CONFIG_ESP32P4_PPA_DEBUG
  g_ppa.active_sequence = ++g_ppa.sequence_counter;
  g_ppa.isr_sequence = 0;
  g_ppa.isr_status = 0;
  g_ppa.isr_eof_desc = 0;
  g_ppa.isr_rx_idle = false;
  g_ppa.isr_desc_idle = false;
#endif

  ret = esp32p4_ppa_sync_buffer(config->background.buffer,
                                config->background.buffer_size,
                                ESP_CACHE_MSYNC_FLAG_DIR_C2M |
                                ESP_CACHE_MSYNC_FLAG_UNALIGNED);
  if (ret < 0)
    {
      goto out_reset;
    }

  ret = esp32p4_ppa_sync_buffer(config->foreground.buffer,
                                config->foreground.buffer_size,
                                ESP_CACHE_MSYNC_FLAG_DIR_C2M |
                                ESP_CACHE_MSYNC_FLAG_UNALIGNED);
  if (ret < 0)
    {
      goto out_reset;
    }

  ret = esp32p4_ppa_sync_buffer(config->output.buffer,
                                config->output.buffer_size,
                                ESP_CACHE_MSYNC_FLAG_DIR_C2M |
                                ESP_CACHE_MSYNC_FLAG_INVALIDATE);
  if (ret < 0)
    {
      goto out_reset;
    }

  esp32p4_ppa_prepare_desc(bg_desc, &config->background);
  esp32p4_ppa_prepare_desc(fg_desc, &config->foreground);
  esp32p4_ppa_prepare_desc(out_desc, &config->output);
  ret = esp32p4_ppa_sync_desc(&g_ppa_tx_bg_desc);
  ret = ret < 0 ? ret : esp32p4_ppa_sync_desc(&g_ppa_tx_fg_desc);
  ret = ret < 0 ? ret : esp32p4_ppa_sync_desc(&g_ppa_rx_desc);
  if (ret < 0)
    {
      goto out_reset;
    }

  burst = esp32p4_ppa_dma_burst(handle->burst_length);
  esp32p4_ppa_configure_tx(ESP32P4_PPA_TX_BG_CHANNEL,
                           DMA2D_TRIG_PERIPH_PPA_BLEND,
                           SOC_DMA2D_TRIG_PERIPH_PPA_BLEND_BG_TX,
                           false, burst);
  esp32p4_ppa_configure_tx(ESP32P4_PPA_TX_FG_CHANNEL,
                           DMA2D_TRIG_PERIPH_PPA_BLEND,
                           SOC_DMA2D_TRIG_PERIPH_PPA_BLEND_FG_TX,
                           false, burst);
  esp32p4_ppa_configure_rx(DMA2D_TRIG_PERIPH_PPA_BLEND,
                           SOC_DMA2D_TRIG_PERIPH_PPA_BLEND_RX,
                           false, burst);
  dma2d_ll_rx_enable_interrupt(g_ppa.dma_hal.dev,
                               ESP32P4_PPA_RX_CHANNEL,
                               ESP32P4_PPA_RX_EVENTS, true);
  dma2d_ll_tx_set_desc_addr(g_ppa.dma_hal.dev,
                            ESP32P4_PPA_TX_BG_CHANNEL,
                            (uint32_t)(uintptr_t)bg_desc);
  dma2d_ll_tx_set_desc_addr(g_ppa.dma_hal.dev,
                            ESP32P4_PPA_TX_FG_CHANNEL,
                            (uint32_t)(uintptr_t)fg_desc);
  dma2d_ll_rx_set_desc_addr(g_ppa.dma_hal.dev,
                            ESP32P4_PPA_RX_CHANNEL,
                            (uint32_t)(uintptr_t)out_desc);

  esp32p4_ppa_hal_configure_blend(g_ppa.ppa_hal.dev, config);

  dma2d_ll_tx_start(g_ppa.dma_hal.dev, ESP32P4_PPA_TX_BG_CHANNEL);
  dma2d_ll_tx_start(g_ppa.dma_hal.dev, ESP32P4_PPA_TX_FG_CHANNEL);
  dma2d_ll_rx_start(g_ppa.dma_hal.dev, ESP32P4_PPA_RX_CHANNEL);
  esp32p4_ppa_hal_start_blend(g_ppa.ppa_hal.dev);

  ret = esp32p4_ppa_wait(out_desc, "blend");
  if (ret < 0)
    {
      goto out_reset;
    }

  ret = esp32p4_ppa_sync_buffer(config->output.buffer,
                                config->output.buffer_size,
                                ESP_CACHE_MSYNC_FLAG_DIR_M2C);
  if (ret < 0)
    {
      goto out_reset;
    }

  goto out_unlock;

out_reset:
  esp32p4_ppa_tx_reset(ESP32P4_PPA_TX_BG_CHANNEL);
  esp32p4_ppa_tx_reset(ESP32P4_PPA_TX_FG_CHANNEL);
  esp32p4_ppa_rx_reset();
out_unlock:
  nxmutex_unlock(&g_ppa.lock);
  return ret;
}

int esp32p4_ppa_dma2d_srm(esp32p4_ppa_handle_t handle,
                          const struct esp32p4_ppa_srm_config_s *config)
{
  dma2d_descriptor_t *in_desc = &g_ppa_tx_bg_desc.desc;
  dma2d_descriptor_t *out_desc = &g_ppa_rx_desc.desc;
  dma2d_data_burst_length_t burst;
  ppa_srm_color_mode_t input_mode;
  uint32_t block_h;
  uint32_t block_v;
  int ret;

  ret = nxmutex_lock(&g_ppa.lock);
  if (ret < 0)
    {
      return ret;
    }

  if (!g_ppa.initialized)
    {
      ret = -EIO;
      goto out_unlock;
    }

  esp32p4_ppa_rx_reset();
  esp32p4_ppa_tx_reset(ESP32P4_PPA_TX_BG_CHANNEL);
  ppa_ll_srm_reset(g_ppa.ppa_hal.dev);
  g_ppa.irq_status = 0;
#ifdef CONFIG_ESP32P4_PPA_DEBUG
  g_ppa.active_sequence = ++g_ppa.sequence_counter;
  g_ppa.isr_sequence = 0;
  g_ppa.isr_status = 0;
  g_ppa.isr_eof_desc = 0;
  g_ppa.isr_rx_idle = false;
  g_ppa.isr_desc_idle = false;
#endif

  ret = esp32p4_ppa_sync_buffer(config->input.buffer,
                                config->input.buffer_size,
                                ESP_CACHE_MSYNC_FLAG_DIR_C2M |
                                ESP_CACHE_MSYNC_FLAG_UNALIGNED);
  if (ret < 0)
    {
      goto out_reset;
    }

  ret = esp32p4_ppa_sync_buffer(config->output.buffer,
                                config->output.buffer_size,
                                ESP_CACHE_MSYNC_FLAG_DIR_C2M |
                                ESP_CACHE_MSYNC_FLAG_INVALIDATE);
  if (ret < 0)
    {
      goto out_reset;
    }

  esp32p4_ppa_prepare_desc(in_desc, &config->input);
  esp32p4_ppa_prepare_desc(out_desc, &config->output);
  out_desc->vb_size = 2;
  out_desc->hb_length = 2;
  ret = esp32p4_ppa_sync_desc(&g_ppa_tx_bg_desc);
  ret = ret < 0 ? ret : esp32p4_ppa_sync_desc(&g_ppa_rx_desc);
  if (ret < 0)
    {
      goto out_reset;
    }

  burst = esp32p4_ppa_dma_burst(handle->burst_length);
  esp32p4_ppa_configure_tx(ESP32P4_PPA_TX_BG_CHANNEL,
                           DMA2D_TRIG_PERIPH_PPA_SRM,
                           SOC_DMA2D_TRIG_PERIPH_PPA_SRM_TX,
                           true, burst);
  esp32p4_ppa_configure_rx(DMA2D_TRIG_PERIPH_PPA_SRM,
                           SOC_DMA2D_TRIG_PERIPH_PPA_SRM_RX,
                           true, burst);
  input_mode = esp32p4_ppa_srm_mode(config->input.color_mode);
  ppa_ll_srm_get_dma_dscr_port_mode_block_size(g_ppa.ppa_hal.dev,
    input_mode, ppa_ll_srm_get_mb_size(g_ppa.ppa_hal.dev),
    &block_h, &block_v);
  dma2d_ll_tx_set_dscr_port_block_size(g_ppa.dma_hal.dev,
                                       ESP32P4_PPA_TX_BG_CHANNEL,
                                       block_h, block_v);
  dma2d_ll_rx_enable_interrupt(g_ppa.dma_hal.dev,
                               ESP32P4_PPA_RX_CHANNEL,
                               ESP32P4_PPA_RX_EVENTS, true);
  dma2d_ll_tx_set_desc_addr(g_ppa.dma_hal.dev,
                            ESP32P4_PPA_TX_BG_CHANNEL,
                            (uint32_t)(uintptr_t)in_desc);
  dma2d_ll_rx_set_desc_addr(g_ppa.dma_hal.dev,
                            ESP32P4_PPA_RX_CHANNEL,
                            (uint32_t)(uintptr_t)out_desc);

  esp32p4_ppa_hal_configure_srm(g_ppa.ppa_hal.dev, config);

  dma2d_ll_tx_start(g_ppa.dma_hal.dev, ESP32P4_PPA_TX_BG_CHANNEL);
  dma2d_ll_rx_start(g_ppa.dma_hal.dev, ESP32P4_PPA_RX_CHANNEL);
  esp32p4_ppa_hal_start_srm(g_ppa.ppa_hal.dev);

  ret = esp32p4_ppa_wait(out_desc, "srm");
  if (ret < 0)
    {
      goto out_reset;
    }

  ret = esp32p4_ppa_sync_buffer(config->output.buffer,
                                config->output.buffer_size,
                                ESP_CACHE_MSYNC_FLAG_DIR_M2C);
  if (ret < 0)
    {
      goto out_reset;
    }

  goto out_unlock;

out_reset:
  esp32p4_ppa_tx_reset(ESP32P4_PPA_TX_BG_CHANNEL);
  esp32p4_ppa_rx_reset();
  ppa_ll_srm_reset(g_ppa.ppa_hal.dev);
out_unlock:
  nxmutex_unlock(&g_ppa.lock);
  return ret;
}
